# Дан список чисел [1,2,3,2,1]. Определите, сколько в нем встречается различных чисел.
L = [1, 2, 3, 2, 1]
print('number 1:', L.count(1), ' ', 'number 2:', L.count(2), ' ', 'number 3:', L.count(3))

