# Даны два списка чисел: [1, 2, 6, 4, 5, 7], [10, 2, 3, 4, 8]
# Найдите все числа, которые входят как в первый, так и во второй список и выведите их в порядке возрастания.
s1 = {1, 2, 6, 4, 5, 7}
s2 = {10, 2, 3, 4, 8}
print(s1.intersection(s2))
